## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/wayofthesys-cinema/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

+       node_config {
+           disk_size_gb      = 10
+           disk_type         = "pd-standard"
+           guest_accelerator = []
+           image_type        = "COS_CONTAINERD"
+           labels            = {
+               "cluster_name" = "cinema"
+               "node_pool"    = "core"
            }
+           local_ssd_count   = 1
+           machine_type      = "n2-highcpu-4"
+           metadata          = {
+               "cluster_name"             = "cinema"
+               "disable-legacy-endpoints" = "true"
+               "node_pool"                = "core"
            }
+           oauth_scopes      = [
+               "https://www.googleapis.com/auth/logging.write",
+               "https://www.googleapis.com/auth/monitoring",
            ]
+           preemptible       = true
+           service_account   = "terrateam-tf@wayofthesys-cinema.iam.gserviceaccount.com"
+           spot              = false
+           tags              = [
+               "gke-cinema",
+               "gke-cinema-core",
            ]
+           taint             = []

+           shielded_instance_config {
+               enable_integrity_monitoring = true
+               enable_secure_boot          = false
            }

+           workload_metadata_config {
+               mode = "GKE_METADATA"
            }
        }

+       node_pool {
+           initial_node_count          = 2
+           instance_group_urls         = [
+               "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-460bd46f-grp",
            ]
+           managed_instance_group_urls = [
+               "https://www.googleapis.com/compute/v1/projects/wayofthesys-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-460bd46f-grp",
            ]
+           max_pods_per_node           = 65
+           name                        = "core"
+           node_count                  = 2
+           node_locations              = [
+               "us-central1-a",
            ]
+           version                     = "1.24.3-gke.2100"

+           autoscaling {
+               max_node_count       = 4
+               min_node_count       = 2
+               total_max_node_count = 0
+               total_min_node_count = 0
            }

+           management {
+               auto_repair  = true
+               auto_upgrade = true
            }

+           node_config {
+               disk_size_gb      = 10
+               disk_type         = "pd-standard"
+               guest_accelerator = []
+               image_type        = "COS_CONTAINERD"
+               labels            = {
+                   "cluster_name" = "cinema"
+                   "node_pool"    = "core"
                }
+               local_ssd_count   = 1
+               machine_type      = "n2-highcpu-4"
+               metadata          = {
+                   "cluster_name"             = "cinema"
+                   "disable-legacy-endpoints" = "true"
+                   "node_pool"                = "core"
                }
+               oauth_scopes      = [
+                   "https://www.googleapis.com/auth/logging.write",
+                   "https://www.googleapis.com/auth/monitoring",
                ]
+               preemptible       = true
+               service_account   = "terrateam-tf@wayofthesys-cinema.iam.gserviceaccount.com"
+               spot              = false
+               tags              = [
+                   "gke-cinema",
+                   "gke-cinema-core",
                ]
+               taint             = []

+               shielded_instance_config {
+                   enable_integrity_monitoring = true
+                   enable_secure_boot          = false
                }

+               workload_metadata_config {
+                   mode = "GKE_METADATA"
                }
            }

+           upgrade_settings {
+               max_surge       = 1
+               max_unavailable = 0
            }
        }

        # (17 unchanged blocks hidden)
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/prod"] has changed
!   resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/wayofthesys-cinema/regions/us-central1/subnetworks/prod"
        name                       = "prod"
!       private_ip_google_access   = false -> true
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@wayofthesys-cinema.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/wayofthesys-cinema/serviceAccounts/external-dns@wayofthesys-cinema.iam.gserviceaccount.com/keys/08495c808d19cea76a108bb2e72354967a581eba" -> (known after apply)
!       name               = "projects/wayofthesys-cinema/serviceAccounts/external-dns@wayofthesys-cinema.iam.gserviceaccount.com/keys/08495c808d19cea76a108bb2e72354967a581eba" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJYnBZRTl5Zy8rOWN3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTNOemd3TlRnNU1ESXlNRFEwT1RNek5qTTJNQ0FYRFRJeU1Ea3lNREF3TVRBek9Wb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EYzNPREExT0Rrd01qSXdORFE1TXpNMk16WXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRREdXcDdIQ2huUzZVWHh6T09BRDVsajBZREUKdjVHaEw5NVpwdWZIQTBicG9pL1FCK2owemhGRStGTmhyVFFjQWxwMW5xd1BFNFpSYzhSNkhGWDlLMStrSTZPcwpVcXBMRzRvd21NclpGcithYkVZSVJ5TlpBUDBrK3R5MDdYZDQzdUsyRGhMdzM1bkkyVlVxSXNyaG03MHI3SU13CkJRVXRuQjhyVTRNeDZrcGJ0VXlOaXJMQlJ1Mk9Ec2l5QXhUd04wV0h3MXJrZGI5OFZ0YkdRTEkxKzhSdmZCc3cKbnNnSVBOaXdOcnJaSXRrVHRtUWVodEVya2tHem50Y0t5SjZhMFFOczBGNHFROGE0NEJ2TEF3SW9wZ2RLV1lqNgp1a3AzbGVWV3AwRnZta3EwYUp2VG5Ja0FZOVlZdzQ2eUdObmVuQ0RHUTNOMlJUQjdkN1lMb2FRQzRPeUZBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRQ3luVXV6NmNvUnNKbmp5NHcxY0w2Rgp4bWlldGpRT0tmSnQ4NmJDbkJRSWNiMzJza1dzZld2Z3VkZithZGpBYjh5WklZc3ZmOVUvTnV3ZE54QTVYelgwCkRETjVaMGRFWWpDR0Jub1VpNzJGWVhacFFPUWhJY1REZ0o0aUZPLzF1TzN4WUVHZjNWSjBIc0hDbmVZeVVSOHcKNDVmVlZyV2JvZ0FGcSsxWlN3Z0lsb0Vld0p3cGhuYXU2UmRFT2JFajEyNEhpeXg4dnpiM2NKRWtnTm9IQzdndQpNR3pBb1BBQmlmMWFCYnZ5cVcrbU9pcTF2dkFJOHp2ZXhVejN5TG4ycmVablZYQUR0ZzhpYVpCdW1kQ3BVckE1CkRhUy80Q2svSGVuUGV2cU04Z0FiL294ZFdyYmpuaEtlcG9SMzJQM29IV0xXV3RWNElsbFhkdm9zbTJBMGM0ankKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/wayofthesys-cinema/serviceAccounts/external-dns@wayofthesys-cinema.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-20T00:10:39Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.argocd.helm_release.argocd will be created
+   resource "helm_release" "argocd" {
+       atomic                     = false
+       chart                      = "argo-cd"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argocd"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                "configs":
                  "repositoryCredentials": {}
                "global":
                  "image":
                    "tag": null
                "server":
                  "config":
                    "repositories": |
                      []
                  "extraArgs": null
                  "ingress":
                    "annotations":
                      "kubernetes.io/ingress.class": "nginx"
                      "nginx.ingress.kubernetes.io/force-ssl-redirect": "true"
                      "nginx.ingress.kubernetes.io/ssl-passthrough": "true"
                    "enabled": true
                    "hosts":
-                     "argocd.wayofthesys.com."
                    "https": true
                    "tls":
-                     "hosts":
-                       "argocd.wayofthesys.com."
                      "secretName": "argocd-tls"
                  "rbacConfig": {}
            EOT,
        ]
+       verify                     = false
+       version                    = "2.11.2"
+       wait                       = true
+       wait_for_jobs              = false
    }

  # module.gke-cinema.data.google_compute_zones.available will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_compute_zones" "available" {
+       id      = (known after apply)
+       names   = (known after apply)
+       project = "wayofthesys-cinema"
+       region  = "us-central1"
    }

  # module.gke-cinema.data.google_container_engine_versions.region will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "region" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1"
+       project                         = "wayofthesys-cinema"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.data.google_container_engine_versions.zone will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_container_engine_versions" "zone" {
+       default_cluster_version         = (known after apply)
+       id                              = (known after apply)
+       latest_master_version           = (known after apply)
+       latest_node_version             = (known after apply)
+       location                        = "us-central1-a"
+       project                         = "wayofthesys-cinema"
+       release_channel_default_version = (known after apply)
+       valid_master_versions           = (known after apply)
+       valid_node_versions             = (known after apply)
    }

  # module.gke-cinema.google_container_cluster.primary will be updated in-place
!   resource "google_container_cluster" "primary" {
        id                          = "projects/wayofthesys-cinema/locations/us-central1/clusters/cinema"
!       min_master_version          = "1.24.3-gke.2100" -> (known after apply)
        name                        = "cinema"
        # (26 unchanged attributes hidden)

        # (19 unchanged blocks hidden)
    }

  # module.gke-cinema.random_shuffle.available_zones must be replaced
-/+ resource "random_shuffle" "available_zones" {
!       id           = "-" -> (known after apply)
!       input        = [
-           "us-central1-a",
-           "us-central1-b",
-           "us-central1-c",
-           "us-central1-f",
        ] -> (known after apply) # forces replacement
!       result       = [
-           "us-central1-f",
-           "us-central1-a",
-           "us-central1-b",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vpc-cinema.module.subnets.google_compute_subnetwork.subnetwork["us-central1/prod"] will be updated in-place
!   resource "google_compute_subnetwork" "subnetwork" {
        id                         = "projects/wayofthesys-cinema/regions/us-central1/subnetworks/prod"
        name                       = "prod"
!       private_ip_google_access   = true -> false
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 2 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
